Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: As the coordinates returned by this function include the window's title bar, menu and borders, they may be dependent on OS version and theme.
ja: この関数が返す座標にはウィンドウのタイトルバー、メニュー、ボーダーが含まれるため、OSのバージョンやテーマに依存する可能性があります。

source: As the default AutoHotkey installation does not include a compressor, compiled scripts are not compressed by default.
ja: AutoHotkeyのデフォルトインストールにはコンプレッサーが含まれていないため、コンパイルされたスクリプトはデフォルトで圧縮されません。

source: As the function and variable namespaces were merged, a callout pattern such as (?C:fn) can also refer to a local or global variable containing a function object, not just a user-defined function.
ja: 関数と変数の名前空間が統合されたため、(?C:fn)のような呼び出しパターンは、ユーザー定義関数だけでなく、関数オブジェクトを含むローカル変数やグローバル変数も参照することができます。

source: As the identity of the alt-tab menu differs between OS versions, it may be helpful to use a window group as shown below.
ja: alt-tabメニューのアイデンティティはOSのバージョンによって異なるため、以下のようにウィンドウグループを使用すると便利な場合があります。

source: As the individual elements are just normal variables, one can assign or retrieve a value, but cannot remove or insert elements.
ja: 個々の要素は通常の変数であるため、値の割り当てや取得は可能ですが、要素の削除や 挿入はできません。

source: As the non-dynamic target of an assignment or the reference operator (&).
ja: 代入や参照演算子(&)の非動的な対象として。

source: As the target of a direct, non-dynamic assignment such as MyVar := "".
ja: MyVar := ""のように、直接、非動的な代入のターゲットとして。

source: As the user drags the left mouse button, a tooltip displays the size of the region inside the drag-area.
ja: ユーザーがマウスの左ボタンをドラッグすると、ドラッグ領域内の領域のサイズがツールチップに表示されます。

source: As these conversions can happen very frequently, whenever a variable containing a number is converted to a string, the result is cached in the variable.
ja: このような変換は非常に頻繁に起こりうるため、数値を含む変数が文字列に変換されるたびに、その結果は変数にキャッシュされます。

source: As values of all types can be thrown, any class is valid for the filter (e.g. String or Map).
ja: すべての型の値が投げられるので、どのようなクラスでもフィルターとして有効です（例：Stringや Map）。

source: As well, special user variables can be created with the format U_Name using the Let and Obey directives, described below.
ja: また、以下に説明するLetディレクティブとObeyディレクティブを使用して、特別なユーザー変数をU_Name形式で作成することもできます。

source: As with all # directives -- which are processed only once when the script is launched -- #UseHook should not be positioned in the script as though it were a function (that is, it is not necessary to have it contained within a subroutine).
ja: スクリプトの起動時に一度だけ処理される#ディレクティブと同様に、#UseHookはスクリプト内で関数のように配置するべきではありません（つまり、サブルーチン内に含める必要はありません）。

source: As with all # directives, this one should not be positioned in the script as though it were a function (i.e. it is not necessary to have it contained within a subroutine).
ja: 他の#ディレクティブと同様に、このディレクティブもスクリプト内で関数であるかのように位置づけるべきではありません（つまり、サブルーチンの中に含ませる必要はありません）。

source: As with all loops, Break may be used to exit the loop prematurely.
ja: すべてのループと同様に、Breakはループを早期に終了するために使われる。

source: As with all loops, Break, Continue and A_Index may be used.
ja: すべてのループと同様に、Break、Continue、A_Indexを使用することができます。

source: As with all methods or functions called dynamically, the callback is not required to declare parameters which the callback itself does not need, but in this case an asterisk must be specified as the final parameter.
ja: 動的に呼び出されるすべてのメソッドや関数と同様に、コールバック自身が必要としないパラメータを宣言する必要はありませんが、この場合、最終パラメータとしてアスタリスクを指定する必要があります。

source: As with all other functions which accept an object, SetTimer now allows expressions which return an object (previously it required a variable reference).
ja: オブジェクトを受け取る他の関数と同様に、SetTimerもオブジェクトを返す式が使えるようになりました（以前は変数参照が必要でした）。

source: As with any call to a method, the method's (normally hidden) this parameter contains a reference to the object through which the method was called; i.e. the event sink object, not the COM object.
ja: メソッドの呼び出しと同様に、メソッドの（通常は非表示の）thisパラメータは、メソッドが呼び出されたオブジェクトへの参照を含んでいます；すなわち、COMオブジェクトではなく、イベントシンクオブジェクトです。

source: As with function call expressions, the target of a function call statement does not have to be a predefined function; it can instead be a variable containing a function object.
ja: 関数呼び出し式と同様に、関数呼び出し文のターゲットは定義済みの関数である必要はなく、代わりに関数オブジェクトを含む変数にすることができます。

source: As with function calls, there must be no space between the function name and open-parenthesis.
ja: 関数呼び出しと同様に、関数名とオープン括弧の間にはスペースを入れてはいけません。

source: As with methods, each function has a hidden parameter named this, and set has a second hidden parameter named value.
ja: メソッドと同様、各関数にはthisという隠しパラメータがあり、setには valueという2番目の隠しパラメータがある。

source: As with methods, the first parameter of Get, Set or Call is this (the target object).
ja: メソッドと同様に、Get、Set、Callの第1パラメータはthis（対象オブジェクト）です。

source: As with other controls, the text is retrieved or set as-is; no end-of-line translation is performed.
ja: 他のコントロールと同様に、テキストはそのまま取得または設定され、行末の翻訳は行われません。

source: As with other window events, if the current thread is uninterruptible, the Size event won't be raised until the thread becomes interruptible.
ja: 他のウィンドウイベントと同様に、現在のスレッドが割り込み不可能な場合、スレッドが割り込み可能になるまで、Sizeイベントは発生しません。

source: As with the = and == operators, when CaseSense is omitted, numeric comparison is performed if SwitchValue and the case value are both pure numbers, or if one is a pure number and the other is a numeric string.
ja: 演算子=や ==と同様に、CaseSenseが省略された場合、SwitchValueとケース値が両方とも純粋な数値である場合、または一方が純粋な数値で他方が数値文字列である場合に数値比較が実行されます。

source: As you've seen above, the escape character ` (known by backquote, backtick, grave accent and other names) has special meaning, so if you want to send that character literally (or send the corresponding key), you need to double it up, as in Send "``".
ja: 上で見たように、エスケープ文字`（backquote、backtick、grave accentなどの名前で知られている）には特別な意味があるので、その文字を文字通り送りたい（または対応するキーを送りたい）場合は、 Send "``" ように二重にする必要があります。

source: Asc() (use Ord)
ja: Asc()（Ord使用）

source: Aside from calling the many useful predefined functions, a script can define its own functions.
ja: 便利な定義済み関数を呼び出すだけでなく、スクリプトは独自の関数を定義することができます。

source: Aside from the command line to execute, the Run function accepts a few other parameters that affect its behaviour.
ja: 実行するコマンドラインの他に、Run関数はその動作に影響を与えるいくつかのパラメータを受け付けます。

source: Aside from using square brackets, parameters of properties are defined the same way as parameters of methods - optional, ByRef and variadic parameters are supported.
ja: 角括弧を使用することを除けば、プロパティのパラメータはメソッドのパラメータと同じように定義され、オプショナル、ByRef、バリアディックパラメータに対応しています。

source: Aside from whitespace and comments, no other code can be written on the same line as a label.
ja: 空白とコメントを除き、ラベルと同じ行に他のコードを記述することはできません。

source: Asking for Help
ja: 助けを求める

source: Asks Winamp which track number is currently active (see Automating Winamp for more information).
ja: Winampに、現在アクティブなトラック番号を問い合わせます（詳しくは「Winampの自動化」を参照）。

source: Asks the user before exiting the script.
ja: スクリプトを終了する前に、ユーザーに問いかけます。

source: Assign an item:
ja: 項目を割り当てます：

source: Assigning "vk00sc000" disables masking and is equivalent to assigning "".
ja: vk00sc000 "を割り当てると、マスキングが無効になり、""を割り当てたのと同じになります。

source: Assigning Hotkeys
ja: ホットキーの割り当て

source: Assigning a formatted date/time string to the control is not supported.
ja: コントロールにフォーマットされた日付/時刻文字列を割り当てることはサポートされていません。

source: Assigning a value to A_LastError also causes the OS's SetLastError() function to be called.
ja: A_LastErrorに値を代入すると、OSのSetLastError()関数も呼び出されます。

source: Assignment expressions such as x.y := z now always yield the value of z, regardless of how x.y is implemented.
ja: x.y := zのような代入式は、x.y の実装方法に関係なく、常にz の値を返すようになりました。

source: Assignments, as in x := y, compound assignments such as x += y, and increment/decrement operators such as ++x and x--.
ja: x := yのような代入、x += yのような複合代入、++xやx--のようなインクリメント/デクリメント演算子。

source: Assigns a non-standard resource ID to be used for the main script for compilations which use an .exe base file (see Embedded Scripts).
ja: .exe ベースファイルを使用するコンパイルのメインスクリプトに使用する非標準のリソース ID を割り当てます（「埋め込みスクリプト」を参照）。

source: Assigns a non-standard resource ID to the main script.
ja: 非標準のリソースIDをメインスクリプトに割り当てる。

source: Assume there is a source line followed by two compiler directives as follows:
ja: ソース行に続いて、次のような2つのコンパイラ指令があるとする：

source: At least one Gui (or the script's main window) is visible.
ja: 少なくとも1つのGui（またはスクリプトのメインウィンドウ）が表示されています。

source: At least one InputHook is active.
ja: 少なくとも1つのInputHookがアクティブです。

source: At least one OnClipboardChange callback function has been set.
ja: 少なくとも1つのOnClipboardChangeコールバック関数が設定されています。

source: At least one hotkey or hotstring has been defined by the script.
ja: スクリプトで少なくとも1つのホットキーまたはホットストリングが定義されています。

source: At least one of these is required.
ja: これらのうち少なくとも1つは必須である。

source: At least one script timer is currently enabled.
ja: 少なくとも1つのスクリプトタイマーが現在有効になっています。

source: At most one previous instance is detected and sent a message asking it to close.
ja: 最大で1つ前のインスタンスが検出され、終了を促すメッセージが送られる。

source: At the beginning of each iteration, the enumerator is called to retrieve the next value or pair of values.
ja: 各反復の最初に、次の値または値のペアを取得するために列挙者が呼び出されます。

source: At the very beginning of a regular expression, specify zero or more of the following options followed by a close-parenthesis.
ja: 正規表現の冒頭で、以下のオプションを0個以上指定し、その後に閉じ括弧を付ける。

source: At this stage, we haven't defined a hotkey (in other words, assigned a keyboard shortcut), so the instructions are carried out immediately.
ja: この段階では、ホットキー（言い換えれば、キーボードショートカットの割り当て）を定義していないので、すぐに指示が実行されます。

source: Attempted assignment to a read-only variable.
ja: 読み取り専用変数への代入を試みた。

source: Attempted assignment to something which isn't a variable (or array element).
ja: 変数（または配列要素）でないものに代入しようとしましたた。

source: Attempted double-deref with an empty name, such as fn(%empty%).
ja: fn(%empty%) のように、空の名前でダブルデフを試みました。

source: Attempting math on a non-numeric value.
ja: 数値以外の値で計算を試みます。

source: Attempting to assign to this property causes an exception to be thrown if the Map is not empty.
ja: このプロパティに代入しようとすると、Mapが空でない場合は例外が発生する。

source: Attempting to call a non-variadic function with more parameters than it accepts is considered an error.
ja: 非可変型関数を、その関数が受け入れる以上のパラメータで呼び出そうとすると、エラーとみなされます。

source: Attempting to copy a file onto itself via two different paths still causes an error.
ja: 2つの異なるパスでファイルを自分自身にコピーしようとすると、やはりエラーになります。

source: Attempting to read a variable which has not been assigned a value is considered an error, so it is important to initialize variables.
ja: 値が割り当てられていない変数を読み込もうとするとエラーとなるため、変数の初期化は重要です。

source: Attempting to read an uninitialized variable causes an exception to be thrown.
ja: 初期化されていない変数を読み込もうとすると、例外が発生します。

source: Attempting to read an uninitialized variable is considered an error.
ja: 初期化されていない変数を読み込もうとすると、エラーとみなされます。

source: Attempting to read the parameter's value when it has none is considered an error, the same as for any uninitialized variable.
ja: パラメータに値がないのに読み込もうとすると、初期化されていない変数と同じようにエラーとみなされます。

source: Attempting to reassign a top-level (not nested) class in this manner results in a load time error.
ja: この方法でトップ・レベルの（入れ子になっていない）クラスを再割り当てしようとすると、ロード・タイム・エラーになります。

source: Attempting to retrieve a non-existent property is treated as an error for all types of values or objects, unless __get is defined.
ja: 存在しないプロパティを取得しようとすると、__getが定義されていない限り、すべてのタイプの値またはオブジェクトに対してエラーとして扱われます。

source: Attempting to use an array index which is out of bounds (such as zero, or if its absolute value is greater than the Length of the array) is considered an error and will cause an IndexError to be thrown.
ja: 範囲外の配列インデックス（ゼロや絶対値が配列の長さより大きい場合など）を使用しようとすると、エラーとみなされ、IndexErrorがスローされます。

source: Attempting to use an index which is out of bounds (such as zero, or if its absolute value is greater than the Length of the array) is considered an error and will cause an IndexError to be thrown.
ja: 範囲外のインデックス（ゼロや絶対値が配列の長さより大きい場合など）を使用しようとすると、エラーとみなされ、IndexErrorがスローされます。

source: Attempts to add duplicate entries to a group are ignored.
ja: 重複したエントリーをグループに追加しようとしても無視されます。

source: Attempts to extract all FTP and HTTP URLs from a text or HTML file.
ja: テキストファイルまたはHTMLファイルから、すべてのFTPおよびHTTP URLの抽出を試みます。

source: Attempts to jump out of a finally block using one of these statements are detected as errors at load time where possible, or at run time otherwise.
ja: これらの文を使ってfinallyブロックから飛び出そうとした場合、可能であればロード時に、そうでなければランタイム時にエラーとして検出されます。

source: Attempts to jump out of a Finally block using one of these statements are detected as errors at load time where possible, or at run time otherwise.
ja: これらの文を使ってFinallyブロックから抜け出そうとときは、可能であればロード時に、そうでなければランタイム時にエラーとして検出されます。

source: Audio drivers are capable of exposing other controls, such as bass and treble.
ja: オーディオドライバーは、低音や高音など、他のコントロールを露出させることができる。

source: Author:
ja: 著者：

source: Author: Jim Biancolo and Wikipedia's Lists of Common Misspellings
ja: 著者：Jim Biancoloと ウィキペディアのよくある誤字脱字リスト

source: Auto-complete
ja: オートコンプリート

source: Auto-complete, which typically offers a list of suggestions when you start typing the name of a known function or variable.
ja: オートコンプリートは、通常、既知の関数や変数の名前を入力し始めると、候補のリストを表示します。

source: Auto-concat now requires at least one space or tab in all cases (the v1 documentation says there "should be" a space).
ja: Auto-concatでは、すべてのケースで少なくとも1つのスペースまたはタブが必要になりました（v1のドキュメントでは、スペースが「あるべき」とされています）。

source: Auto-repeating a Keystroke
ja: キーストロークの自動繰り返し

source: Auto-replace hotstrings always generate keystrokes at level 0, since it is usually undesirable for the replacement text to trigger another hotstring or hotkey.
ja: 自動置換ホットストリングは、通常、置換テキストが他のホットストリングやホットキーをトリガーすることは望ましくないので、常にレベル0のキーストロークを生成します。

source: Auto-sizes all columns to fit their contents.
ja: すべてのカラムを、その内容に合わせて自動サイズ調整します。

source: Auto-sizing has no effect when not in Report (Details) view.
ja: レポート（詳細）ビューでない場合は、オートサイズは影響しません。

source: AutoCorrect
ja: 自動修正

source: AutoHotkey 32-bit truncates return values to 32-bit, while AutoHotkey 64-bit supports 64-bit return values.
ja: AutoHotkey 32bitは戻り値を32bitに切り捨て、AutoHotkey 64bitは64bitの戻り値をサポートします。

source: AutoHotkey Basic always produces lowercase digits.
ja: AutoHotkey Basicでは、常に小文字の数字が出力されます。

source: AutoHotkey Beginner Tutorial by tidbit
ja: AutoHotkey初心者チュートリアル tidbit著

source: AutoHotkey Script Showcase
ja: AutoHotkeyスクリプトショーケース

source: AutoHotkey can also be installed from the zip download.
ja: AutoHotkeyは、ZIPダウンロードからインストールすることも可能です。

source: AutoHotkey currently has the following constants:
ja: AutoHotkeyには現在、以下の定数があります：

source: AutoHotkey detects devices which are not plugged in, but does not detect disabled devices.
ja: AutoHotkeyは、プラグインされていないデバイスは検出しますが、無効になっているデバイスは検出しません。

source: AutoHotkey does not have a specific boolean type, so it uses the integer value 0 to represent false and 1 to represent true.
ja: AutoHotkeyには特定のブーリアン型がないため、整数値である0を使用して偽を、1を使用して真を表します。

source: AutoHotkey does not have a value which uniquely represents nothing, null, nil or undefined, as seen in other languages.
ja: AutoHotkeyには、他の言語で見られるような、無、null、nil、undefinedを一意に表す値がありません。

source: AutoHotkey does not install the keyboard and mouse hooks unconditionally because together they consume at least 500 KB of memory (but if the keyboard hook is installed, installing the mouse hook only requires about 50 KB of additional memory; and vice versa).
ja: AutoHotkeyは、キーボードフックとマウスフックを合わせて少なくとも500KBのメモリを消費するため、無条件にインストールしません（ただし、キーボードフックをインストールした場合、マウスフックをインストールしても約50KBの追加メモリしか必要ありません）。

source: AutoHotkey does not install the keyboard and mouse hooks unconditionally because together they consume at least 500 KB of memory.
ja: AutoHotkeyは、キーボードフックとマウスフックを合わせて500KB以上のメモリを消費するため、無条件にインストールしません。

source: AutoHotkey does not natively support unsigned 64-bit integers.
ja: AutoHotkeyは、符号なし64ビット整数をネイティブでサポートしていません。

source: AutoHotkey does not support Input Method Editors (IME).
ja: AutoHotkeyは、Input Method Editors（IME）をサポートしていません。

source: AutoHotkey doesn't do anything on its own; it needs a script to tell it what to do.
ja: AutoHotkeyは単独では何もしません。スクリプトが必要です。

source: AutoHotkey has only one ternary operator, which takes the form condition ? valueIfTrue : valueIfFalse.
ja: AutoHotkeyには三項演算子が1つだけあり、次のような形をしています条件 ? valueIfTrue : valueIfFalse。

source: AutoHotkey has the ability to have as many hotkeys and hotstrings in one file as you want.
ja: AutoHotkeyには、1つのファイルにいくつでもホットキーやホットストリングを設定できる機能があります。

source: AutoHotkey has the power to define hotkeys that can be used anywhere or only within specific apps, performing any action that you are able to express with code.
ja: AutoHotkeyは、どこでも使えるホットキー、または、特定のアプリ内だけで使えるホットキーを定義し、コードで表現できるあらゆるアクションを実行することができる機能を備えています。

source: AutoHotkey identifies each button on a controller with a unique number between 1 and 32.
ja: AutoHotkeyは、コントローラの各ボタンを1～32のユニークな番号で識別します。

source: AutoHotkey is not designed to perform per-monitor scaling, and therefore has not been marked as per-monitor DPI-aware.
ja: AutoHotkeyはモニターごとのスケーリングを行うようには設計されていないため、モニターごとのDPIを認識するようにマークされていません。

source: AutoHotkey is not intended to be used by directly launching the program file, except when using a portable copy.
ja: ポータブルコピーを使用する場合を除いて、AutoHotkeyは実行ファイルを直接起動して使用することを意図していません。

source: AutoHotkey is not magic, we all wish it was, but it is not.
ja: AutoHotkeyは魔法ではありません。みんなががそうであってほしいと思っていますが、そうではありません。

source: AutoHotkey loads the script and then exits instead of running it.
ja: AutoHotkeyはスクリプトをロードし、実行せずに終了します。

source: AutoHotkey loads the script but does not run it.
ja: AutoHotkeyはスクリプトをロードしますが、実行しません。

source: AutoHotkey no longer overrides the system ForegroundLockTimeout setting at startup.
ja: AutoHotkeyは、起動時にシステムのForegroundLockTimeout設定を上書きしなくなりました。

source: AutoHotkey primarily uses two data types for pure numbers:
ja: AutoHotkeyでは、主に純粋な数値に対して2つのデータ型を使用します：

source: AutoHotkey removes the second kind in most cases, which enables the script to work around the first kind.
ja: AutoHotkeyはほとんどの場合、2番目の種類を削除し、スクリプトが1番目の種類を回避できるようにします。

source: AutoHotkey supports these number formats:
ja: AutoHotkeyは、これらの数値フォーマットに対応しています：

source: AutoHotkey supports these types of values:
ja: AutoHotkeyは、このようなタイプの値をサポートしています：

source: AutoHotkey uses a basic reference counting mechanism to automatically free the resources used by an object when it is no longer referenced by the script.
ja: AutoHotkeyは、基本的な参照カウント機構を使用して、オブジェクトがスクリプトから参照されなくなったときに、そのオブジェクトが使用していたリソースを自動的に解放します。

source: AutoHotkey uses a basic reference-counting mechanism to automatically free the resources used by an object when it is no longer referenced by the script.
ja: AutoHotkeyは、基本的な参照カウント機構を使用して、オブジェクトがスクリプトから参照されなくなったときに、そのオブジェクトが使用していたリソースを自動的に解放します。

source: AutoHotkey uses the idFrom and hwndFrom fields to identify which control sent the notification, in order to dispatch it to the appropriate object.
ja: AutoHotkeyは、idFromと hwndFromフィールドを使用して、どのコントロールが通知を送信したかを識別し、適切なオブジェクトにディスパッチするために使用します。

source: AutoHotkey uses the following rules to decide which encoding to use:
ja: AutoHotkeyは以下のルールを使用して、使用するエンコーディングを決定します：

source: AutoHotkey uses the same set of rules for naming various things, including variables, functions, window groups, classes, properties and methods.
ja: AutoHotkeyでは、変数、関数、ウィンドウグループ、クラス、プロパティ、メソッドなど、さまざまなものの命名に同じルールを採用しています。

source: AutoHotkey v1 Scripts and Functions Forum
ja: AutoHotkey v1スクリプトと関数のフォーラム

source: AutoHotkey v1 had no concept of a default property, so the COM object wrapper would invoke the default property if the property name was omitted; i.e. obj[] or obj[,x].
ja: AutoHotkey v1にはデフォルトプロパティの概念がなかったため、COMオブジェクトラッパーはプロパティ名が省略された場合、デフォルトプロパティを呼び出していました（例：obj[]またはobj[,x]）。

source: AutoHotkey v1.1 is also known as "AutoHotkey_L", while AutoHotkey v1.0 was retrospectively labelled "AutoHotkey Basic".
ja: AutoHotkey v1.1は「AutoHotkey_L」とも呼ばれ、AutoHotkey v1.0は「AutoHotkey Basic」と後付で表記された。

source: AutoHotkey v2 Help
ja: AutoHotkey v2 ヘルプ

source: AutoHotkey v2 defaults to UTF-8 for all script files, although this can be overridden with the /CP command line switch.
ja: AutoHotkey v2は、すべてのスクリプトファイルのデフォルトをUTF-8に設定していますが、これは/CPコマンドラインスイッチで上書きすることができます。

source: AutoHotkey v2 includes a launcher which allows multiple versions of AutoHotkey to co-exist while sharing one file extension (.ahk).
ja: AutoHotkey v2には、1つのファイル拡張子（.ahk）を共有しながら、複数のバージョンのAutoHotkeyを共存させることができるランチャーが含まれています。

source: AutoHotkey v2 natively uses Unicode (UTF-16), but some external libraries or window messages might require ANSI strings.
ja: AutoHotkey v2はネイティブでUnicode（UTF-16）を使用しますが、一部の外部ライブラリやウィンドウメッセージではANSI文字列を必要とする場合があります。

source: AutoHotkey versions older than v1.1.06 behave as though #InputLevel 0 and SendLevel 0 are in effect.
ja: v1.1.06より古いバージョンのAutoHotkeyは、#InputLevel 0と SendLevel 0が有効であるかのように動作します。

source: AutoHotkey would not be what it is today without these individuals.
ja: AutoHotkeyは、このような人たちのおかげで今日の地位を築いたのです。

source: AutoHotkey's hotkeys have some other features that are worth exploring.
ja: AutoHotkeyのホットキーには、他にもいくつかの機能があります。

source: AutoHotkey's installer comes packaged as a 7-zip self-extracting archive which attempts to extract to the user's Temp directory and execute a compiled script.
ja: AutoHotkeyのインストーラーは、7-zipの自己解凍型アーカイブとしてパッケージ化されており、ユーザーのTempディレクトリに展開し、コンパイルされたスクリプトを実行しようとするものです。

source: AutoHotkey's installer registers the RunAs verb for .ahk files, which allows Run "*RunAs script.ahk" to launch a script as admin.
ja: AutoHotkeyのインストーラは、.ahkファイルに対してRunAs動詞を登録しており、Run "*RunAs script.ahk"でスクリプトを管理者として起動できます。

source: AutoHotkey's object design was influenced primarily by JavaScript and Lua, with a little C#.
ja: AutoHotkeyのオブジェクトデザインは、主にJavaScriptとLuaの影響を受けており、C#も少し含まれています。

source: AutoHotkey's regular expressions are implemented using Perl-compatible Regular Expressions (PCRE) from www.pcre.org.
ja: AutoHotkeyの正規表現は、www.pcre.orgのPerl-compatible Regular Expressions (PCRE)を使用して実装されています。

source: AutoHotkey-aware editors may provide:
ja: AutoHotkeyに対応したエディターが提供することもある：

source: AutoHotkey.ahk is launched instead of AutoHotkey.ini
ja: AutoHotkey.iniの代わりにAutoHotkey.ahkが起動します

source: AutoHotkey_L includes some enhancements to the way the Run and RunWait commands interpret the Target parameter.
ja: AutoHotkey_Lでは、RunコマンドとRunWaitコマンドがTargetパラメータを解釈する方法がいくつか強化されています。

source: AutoTrim (use Trim)
ja: AutoTrim（Trim使用）

source: Automate game actions on the screen
ja: 画面上でゲームの動作を自動化する

source: Automates an existing Internet Explorer window.
ja: 既存のInternet Explorerのウィンドウを自動化します。

source: Automatic backspacing is not done to erase the abbreviation you type.
ja: 自動バックスペースは、入力した略号を消すために行うものではありません。

source: Automatic scaling is performed by the Gui and GuiControl methods/properties by default, so that GUI scripts with hard-coded positions, sizes and margins will tend to scale as appropriate on high DPI screens.
ja: 自動スケーリングは、デフォルトでGuiとGuiControlのメソッド/プロパティによって実行されるため、ハードコードされた位置、サイズ、マージンを持つGUIスクリプトは、高DPIスクリーン上で適切にスケーリングされる傾向があります。

source: Automatically listen for a connection from the debugger engine, rather than waiting for the user to click Start Listening.
ja: ユーザーが「リスニング開始」をクリックするのを待つのではなく、デバッガーエンジンからの接続を自動的にリスニングします。

source: Automatically scrolls text to the right by 10 characters when the user types a character at the end of the line.
ja: 行末に文字を入力すると、自動的にテキストを右に10文字スクロールする。

source: Automatically scrolls the text in an edit control to the right when the user types a character at the end of the line.
ja: ユーザーが行末の文字を入力すると、エディットコントロールのテキストを自動的に右にスクロールする。

source: Automatically selects the previous control in the z-order as the UpDown control's buddy control.
ja: UpDownコントロールのバディコントロールとして、Zオーダーで前のコントロールを自動的に選択する。

source: Automating Winamp
ja: Winampの自動化

source: Automating Winamp | AutoHotkey v2
ja: Winampの自動化｜AutoHotkey v2

source: Avoid handling functions by name (string) where possible; use references instead.
ja: 関数を名前（文字列）で扱うことはできるだけ避け、代わりにリファレンスを使用します。

source: Avoid using hard-coded coordinates wherever possible.
ja: 可能な限り、ハードコードされた座標の使用を避けます。
